reading-note/从0开始学架构.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-10 二 19:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>从 0 开始学架构</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">从 0 开始学架构</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb472a27">1. 开篇词</a></li>
<li><a href="#org2c35f22">2. 架构到底是什么？</a></li>
<li><a href="#org6a1118b">3. 架构设计的历史背景</a></li>
<li><a href="#orge4853b3">4. 架构设计的目的</a></li>
<li><a href="#org596f238">5. 复杂度来源：高性能</a></li>
</ul>
</div>
</div>
<p>
本文是极客时间<a href="https://time.geekbang.org/column/intro/81">《从 0 开始学架构》</a>笔记。
</p>

<div id="outline-container-orgb472a27" class="outline-2">
<h2 id="orgb472a27"><span class="section-number-2">1</span> 开篇词</h2>
<div class="outline-text-2" id="text-1">
<p>
架构设计的关键思想是判断和取舍，程序设计的关键思维是逻辑与实现。
</p>
</div>
</div>

<div id="outline-container-org2c35f22" class="outline-2">
<h2 id="org2c35f22"><span class="section-number-2">2</span> 架构到底是什么？</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>系统与子系统
<ul class="org-ul">
<li>系统是相互协作可运行的实体。</li>
</ul></li>
<li>模块与组件
<ul class="org-ul">
<li>组件是从技术维度上的复用。</li>
<li>模块是从业务维度上职责的划分。</li>
</ul></li>
<li>框架与架构
<ul class="org-ul">
<li>框架是面向变成或配置的半成品。</li>
<li>架构软件的顶层设计。</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6a1118b" class="outline-2">
<h2 id="org6a1118b"><span class="section-number-2">3</span> 架构设计的历史背景</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><p>
第一次软件危机引出了“结构化”编程。
</p>

<p>
结构化程序的特点是抛弃 goto 语句，采用“自顶向下、逐步细化、模块化”的指导思想。本质上还是一种面向过程的设计思想。
</p>

<p>
第一次软件危机的根源在于软件的“逻辑”变得非常复杂。
</p></li>

<li><p>
第二次软件危机引出了“面向对象”编程。
</p>

<p>
第二次软件危机的根源在于当时软件“扩展”变得非常复杂。
</p></li>

<li><p>
软件架构的出现是因为软件的“规模”愈加庞大。
</p>

<p>
当系统由许多部分组成时，整个系统的组织，也就是所谓的“软件架构”，导致了一系列新的设计问题。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orge4853b3" class="outline-2">
<h2 id="orge4853b3"><span class="section-number-2">4</span> 架构设计的目的</h2>
<div class="outline-text-2" id="text-4">
<p>
架构设计的主要目的是为了解决软件系统复杂度带来的问题。
</p>

<p>
那么，如何做架构设计呢？就是要找到软件系统系统的的“复杂点”。
</p>

<p>
常见架构设计错误：
</p>
<ul class="org-ul">
<li>架构混乱。要分析需求，识别复杂点。</li>
<li>照搬别人的架构。错在不同的系统复杂点不同，架构自然不同。</li>
<li>贪大求全。架构设计并不是为了面面俱到，而是识别复杂点，针对性的解决问题。</li>
</ul>
</div>
</div>

<div id="outline-container-org596f238" class="outline-2">
<h2 id="org596f238"><span class="section-number-2">5</span> 复杂度来源：高性能</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-09-10 二 19:59</p>
<p class="validation"></p>
</div>
</body>
</html>
